// // // // 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.
// let mass = [2, 3, 55, 646, 789, 343, 22, 5, 9.9, 985.5];
// function sum() {
//     // let result = ();
// }

// // 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр
// let book = {
//     name: 'Буремний перевал',
//     page: 400,
//     janr: 'роман',
// }

// // 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори
// let book = {
//     name: 'Джейн Ейр',
//     page: 390,
//     janr: 'роман',
//     authors: 'Шарлотта Бронте',
// }

// // // 4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт
// let books = [
//     {
//         name: 'Джейн Ейр',
//         page: 390,
//         janr: 'роман',
//         authors: 'Шарлотта Бронте',
//     },
//     {
//         name: 'Буремний перевал',
//         page: 400,
//         janr: 'роман',
//         authors: 'Шарлотта Бронте',
// }
// ];
// console.log(books[0], books[1]);

// // 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// // Значення площі зберігати в змінній s.
// let height = 23;
// let width = 10;
// function area(height, width){
//     let s = 2 * (a + b);
//     return s;
// }
// let s = area(height, width);
// console.log(s);

// // 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// // результат помістіть у змінну v.
// let heightC = 10;
// let dC = 4;
// let a = 2;
// function vol(heightC, dC) {
//     let r = (dC / a);
//     console.log(r);
//     let v = (Math.PI * (r**2) * heightC);
//     return v;
// }
// let v = vol(heightC, dC);
// console.log(v);

// // 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// // Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).
// let n = 3;
// let m = 4;
// function j(n, m){
//     let k = (n ** 2) * (m ** 2);
//     return k;
// }
// let k = j(n, m);
// console.log(k);
